<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"da0b40621e3d8975c8fb5482054c2c5d5929b6825c3a509a6a8e4560d1b7cce9","plan_job_ref":"Job .github/workflows/_test-tf.yaml #1 at https://github.com/DND-IT/github-workflows/actions/runs/13578250046","plan_out_hash":"2c3a1a7395499235bfb880b72aae582f46f6afef58c18439a47729c8900b9eff","plan_hash":"66354ef0f35b3c6dbea417fc5c6be09c8c4a368460d6fc8b34f3aa703014336d","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #1](https://github.com/DND-IT/github-workflows/actions/runs/13578250046)